In [1]:
import numpy as np
import pandas as pd

# 매출 데이터를 담은 Series를 만들고, 멀티 인덱스를 설정하세요
• 인덱스: 지역-지점
• 값: 매출
서울 전체 매출을 조회하세요
부산 해운대점 매출을 조회하세요

In [2]:
busan = pd.Series([120, 100, 90, 80],
                 index=[['서울', '서울', '부산', '부산'],
                        ['강남점', '강북점', '해운대점', '서면점']])

In [3]:
# 서울 전체 매출을 조회하세요
busan.loc['서울']

강남점    120
강북점    100
dtype: int64

In [6]:
# 부산 해운대점 매출을 조회하세요
busan.loc['부산',['해운대점']]

부산  해운대점    90
dtype: int64

# 쇼핑몰의 판매량 데이터를 담은 Series를 만들고, 멀티 인덱스을 설정하세요
• 인덱스 : 카테고리-상품명
• 값: 판매량
전자제품 카테고리 전체 판매량을 조회하세요
식품 카테고리의 라면 판매량을 조회하세요

In [7]:
shop = pd.Series([300, 250, 500, 400],
                index=[['전자제품', '전자제품', '식품', '식품'],
                      ['노트북', '휴대폰', '라면', '과자']])

In [8]:
# 전자제품 카테고리 전체 판매량을 조회하세요
shop.loc['전자제품']

노트북    300
휴대폰    250
dtype: int64

In [10]:
# 식품 카테고리의 라면 판매량을 조회하세요
shop.loc['식품', ['라면']]

식품  라면    500
dtype: int64

# 도서관의 대출 건수를 담은 Series를 만들고 멀티 인덱스를 설정하세요
• 인덱스: 학년-과목
• 값: 대출 건수
1학년 전체 대출 건수를 조회하세요
2학년 수학 과목의 대출 건수를 조회하세요

In [12]:
lib = pd.Series([40, 35, 50, 45],
               index=[['1학년', '1학년', '2학년', '2학년'],
                     ['국어', '수학', '국어', '수학']])

In [15]:
# 1학년 전체 대출 건수를 조회하세요
lib.loc['1학년']

국어    40
수학    35
dtype: int64

In [16]:
# 2학년 수학 과목의 대출 건수를 조회하세요
lib.loc['2학년',['수학']]

2학년  수학    45
dtype: int64

# 도서관 대출 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
• 행 인덱스: 도서관-월
• 열: 소설, 과학
• 값: 대출 건수
중앙도서관 전체 대출 건수를 조회하세요
시립도서관 2월의 과학 대출 건수를 조회하세요

In [62]:
lib = pd.DataFrame([[120, 45], [95, 60], [150, 70], [110, 55]],
                  index=[['중앙도서관', '중앙도서관', '시립도서관', '시립도서관'],
                         ['1월', '2월', '1월', '2월']],
                  columns=['소설', '과학'])

In [63]:
lib

           소설  과학
중앙도서관 1월  120  45
      2월   95  60
시립도서관 1월  150  70
      2월  110  55

In [64]:
# 중앙도서관 전체 대출 건수를 조회하세요
lib.loc['중앙도서관']

     소설  과학
1월  120  45
2월   95  60

In [65]:
# 시립도서관 2월의 과학 대출 건수를 조회하세요
lib.loc[('시립도서관', '2월'), '과학']

np.int64(55)

자동차 판매량 데이터를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
• 행 인덱스: 연도-차종
• 열: 1분기, 2분기
• 값: 판매 대수
2022년 전체 판매량을 조회하세요
2023년 세단의 2분기 판매량을 조회하세요

In [66]:
car = pd.DataFrame([[320, 280], [210, 230], [400, 390], [180, 200]],
                  index=[['2022년', '2022년', '2023년', '2023년'],
                        ['SUV', '세단', 'SUV', '세단']],
                  columns=['1분기', '2분기'])
car

           1분기  2분기
2022년 SUV  320  280
      세단   210  230
2023년 SUV  400  390
      세단   180  200

In [67]:
# 2022년 전체 판매량을 조회하세요
car.loc['2022년']

     1분기  2분기
SUV  320  280
세단   210  230

In [78]:
# 2023년 세단의 2분기 판매량을 조회하세요
car.loc[('2023년', '세단'), '2분기']

np.int64(200)

# 호텔 예약 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
• 행 인덱스: 지점-월
• 열: 싱글룸, 더블룸
• 값: 예약 건수
서울지점 전체 예약 건수를 조회하세요
부산지점 8월의 더블룸 예약 건수를 조회하세요

In [80]:
hotel = pd.DataFrame([[45, 30], [50, 35], [60, 40], [55, 38]],
                    index=[['서울지점', '서울지점', '부산지점', '부산지점'],
                           ['7월', '8월', '7월', '8월']],
                    columns=['싱글룸', '더블룸'])
hotel

         싱글룸  더블룸
서울지점 7월   45   30
     8월   50   35
부산지점 7월   60   40
     8월   55   38

In [83]:
# 서울지점 전체 예약 건수를 조회하세요
hotel.loc['서울지점']

    싱글룸  더블룸
7월   45   30
8월   50   35

In [85]:
# 부산지점 8월의 더블룸 예약 건수를 조회하세요
hotel.loc[('부산지점', '8월'), '더블룸']

np.int64(38)

# 쇼핑몰 주문 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
• 행 인덱스: 카테고리-상품
• 열: 1월, 2월
• 값: 주문 건수
가전 카테고리 전체 주문 건수를 조회하세요
식품 카테고리 라면의 2월 주문 건수를 조회하세요

In [88]:
shop = pd.DataFrame([[120, 140], [80, 95], [200, 220], [150, 160]],
                index=[['가전', '가전', '식품', '식품'],
                      ['노트북', '청소기', '라면', '과자']],
                columns=['1월', '2월'])
shop

         1월   2월
가전 노트북  120  140
   청소기   80   95
식품 라면   200  220
   과자   150  160

In [89]:
# 가전 카테고리 전체 주문 건수를 조회하세요
shop.loc['가전']

      1월   2월
노트북  120  140
청소기   80   95

In [90]:
# 식품 카테고리 라면의 2월 주문 건수를 조회하세요
shop.loc[('식품', '라면'), '2월']

np.int64(220)

# 고객 데이터를 담은 DataFrame와 주문 데이터를 담은 DataFrame를 만들고, 고객ID 기준으로 합치세요

In [91]:
cust = pd.DataFrame({'고객ID' : [101, 102, 103], '이름' : ['철수', '영희', '민수']})
cust

   고객ID  이름
0   101  철수
1   102  영희
2   103  민수

In [93]:
ord = pd.DataFrame({'고객ID' : [101, 104, 102], '상품' : ['노트북', '청소기', '책']})
ord

   고객ID   상품
0   101  노트북
1   104  청소기
2   102    책

In [96]:
ord_list = pd.merge(cust, ord, on='고객ID', how='inner')
ord_list

   고객ID  이름   상품
0   101  철수  노트북
1   102  영희    책

In [95]:
ofi = pd.DataFrame({'사번' : [1, 2, 3], '이름' : ['홍길동', '임꺽정', '이몽룡']})
suf = pd.DataFrame({'사번' : [1, 3], '부서' : ['영업', '개발']})

lis = pd.merge(ofi, suf, on='사번', how='left')
lis

   사번   이름   부서
0   1  홍길동   영업
1   2  임꺽정  NaN
2   3  이몽룡   개발

# 상품 데이터를 담은 DataFrame와 재고 데이터를 담은 DataFrame를 만들고, 상품코드 기준으로 합치세요

In [97]:
shop = pd.DataFrame({'상품코드' : ['A1', 'A2', 'A3'], '상품명' : ['노트북', '청소기', '책상']})
zi = pd.DataFrame({'상품코드' : ['A2', 'A3', 'A4'], '재고' : [5, 8, 10]})
hap = pd.merge(shop, zi, on='상품코드', how='right')
hap

  상품코드  상품명  재고
0   A2  청소기   5
1   A3   책상   8
2   A4  NaN  10

# 학생 데이터를 담은 DataFrame와 동아리 데이터를 담은 DataFrame를 만들고, 학번 기준으로 합치세요

In [98]:
stu = pd.DataFrame({'학번' : [1, 2, 3], '이름' : ['지훈', '서연', '민지']})
dong = pd.DataFrame({'학번' : [2, 4], '동아리' : ['축구부', '합창단']})
hap = pd.merge(stu, dong, on='학번', how='outer')
hap

   학번   이름  동아리
0   1   지훈  NaN
1   2   서연  축구부
2   3   민지  NaN
3   4  NaN  합창단

# 사원 데이터를 담은 DataFrame와 부서 데이터를 담은 DataFrame를 만들고, 하나로 합치세요

In [100]:
ofi = pd.DataFrame({'사번' : [1, 2], '이름' : ['홍길동', '임꺽정']})
suf = pd.DataFrame({'부서' : ['영업', '개발']})
pd.concat([ofi, suf], axis=1)

   사번   이름  부서
0   1  홍길동  영업
1   2  임꺽정  개발

# 세 개의 매출 데이터 DataFrame를 만들고, 하나로 합치세요

In [104]:
df1 = pd.DataFrame({'매출' : [100, 200]})
df2 = pd.DataFrame({'매출' : [150, 250]})
df3 = pd.DataFrame({'매출' : [300, 400]})
pd.concat([df1, df2, df3], ignore_index=True)

    매출
0  100
1  200
2  150
3  250
4  300
5  400

# 두 개의 학생 점수 데이터를 담은 DataFrame를 만들고, 하나로 합치세요

In [107]:
st1 = pd.DataFrame({'이름' : ['철수', '영희'], '국어' : [85, 90]})
st2 = pd.DataFrame({'이름' : ['민수', '지연'], '수학' : [78, 92]})
pd.concat([st1, st2], axis=1)

   이름  국어  이름  수학
0  철수  85  민수  78
1  영희  90  지연  92

# 쇼핑몰 판매 데이터를 담은 DataFrame를 만들고, pivot을 이용해 카테고리별 월 매출을 출력하세요

In [110]:
shop = pd.DataFrame({'카테고리' : ['식품', '식품', '가전', '가전'],
                  '월' : ['1월', '2월', '1월', '2월'],
                  '매출' : [200, 250, 500, 550]})
shop.pivot(index='카테고리', columns='월', values='매출')

월      1월   2월
카테고리
가전    500  550
식품    200  250

# 도서관 대출 데이터를 담은 DataFrame를 만들고, pivot을 이용해 도서관별 장르 대출 건수를 출력하세요

In [112]:
lib = pd.DataFrame({'도서관' : ['중앙', '중앙', '시립', '시립'],
                  '장르' : ['소설', '과학', '소설', '과학'],
                  '대출건수' : [120, 45, 95, 60]})
lib.pivot(index='도서관', columns='장르', values='대출건수')

장르   과학   소설
도서관
시립   60   95
중앙   45  120

# 호텔 예약 데이터를 담은 DataFrame를 만들고, pivot을 이용해 지점별 객실 유형 예약 건수를 출력하세요

In [113]:
hotel = pd.DataFrame({'지점' : ['서울', '서울', '부산', '부산'],
                  '객실유형' : ['싱글룸', '더블룸', '싱글룸', '더블룸'],
                  '예약건수' : [45, 30, 50, 35]})
hotel.pivot(index='지점', columns='객실유형', values='예약건수')

객실유형  더블룸  싱글룸
지점
부산     35   50
서울     30   45